# MovieLens Dataset

The GroupLens MovieLens 1M Dataset project consolidated several collections of users' movie ratings from 1990 - 2000. Per the name, the data contains over 1 million ratings from over 6,000 users of more than 4,000 movies. The data holds users' feedback on movie ratings, users' demographics, and each movie's metadata.

In [34]:
# Start with imports
import pandas as pd

In [36]:
# Make the display smaller 
pd.options.display.max_rows = 10

At the beginning of the analysis we started with three different ZIP files that
held users' information. After extracting out the data from the files, we load 
each table into a pandas DataFrame object using the pandas.read_table function.

In [39]:
# Define the usernames
unames = ['user_id', 'gender', 'age', 'occupation', 'zip']

In [41]:
# Load table into DataFrame
users = pd.read_table('users.dat', sep='::', header=None, names=unames, engine='python')

In [43]:
# Define the user ratings
rnames = ['user_id', 'movie_id', 'rating', 'timestamp']

In [45]:
# Load table into DataFrame
ratings = pd.read_table('ratings.dat', sep='::', header=None, names=rnames, engine='python')

In [46]:
# Define the movie name
mnames = ['movie_id', 'title', 'genres']

In [47]:
# Load table into DataFrame
movies = pd.read_table('movies.dat', sep='::', header=None, names=mnames, engine='python')

In [51]:
# Preview data for atleast 5 lines
users[:5]

   user_id gender  age  occupation    zip
0        1      F    1          10  48067
1        2      M   56          16  70072
2        3      M   25          15  55117
3        4      M   45           7  02460
4        5      M   25          20  55455

In [53]:
ratings[:5]

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [55]:
movies[:5]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [57]:
ratings

         user_id  movie_id  rating  timestamp
0              1      1193       5  978300760
1              1       661       3  978302109
2              1       914       3  978301968
3              1      3408       4  978300275
4              1      2355       5  978824291
...          ...       ...     ...        ...
1000204     6040      1091       1  956716541
1000205     6040      1094       5  956704887
1000206     6040       562       5  956704746
1000207     6040      1096       4  956715648
1000208     6040      1097       4  956715569

[1000209 rows x 4 columns]

Merge the data into a single table with panda's merge function. First
merge the ratings file with the users file then merge that data result 
with the movies file panda chooses which columns to merge based on
overlapping names.

In [60]:
data = pd.merge(pd.merge(ratings, users), movies)